#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_caller_identity.current: Reading...
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-07e469982b4260ec6]
aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-0c6070c1e9d9b7ea1]
data.aws_iam_policy_document.assume_eks_role: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
data.aws_caller_identity.current: Read complete after 1s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231103054542976400000005]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542813400000002]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542902700000004]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542771600000001]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231103054542877500000003]
data.aws_vpc.conquer-vpc: Read complete after 2s [id=vpc-080a377054fdb71a7]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-0ef7a85d17d481c65]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-09bcb4615cab992bf]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-02a05aed2b842b7a1]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-0d916fcfc836e5b9f]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-07ffb1a27ae73de4f]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-0b2027d77926a2e6e]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-06c0209f0cbdf1288]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-0a1513f249115257c]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-0a9c935e2aeff7bdc]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-030d131168ad9d1b7]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-0d916fcfc836e5b9f1080289494]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-0b2027d77926a2e6e1080289494]
data.tls_certificate.eks: Reading...
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
aws_iam_role.AmazonEKS_EBS_CSI_DriverRole: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole]
aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment: Refreshing state... [id=AmazonEKS_EBS_CSI_DriverRole-2023110305533002400000000c]
data.tls_certificate.eks: Read complete after 1s [id=5007ea61dfb4fcd4db18c0c232d56bef3b07d3dc]
aws_iam_openid_connect_provider.eks-idp: Refreshing state... [id=arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/77399B99DE012E754D2267B9BDDEED73]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = "arn:aws:iam::014630368052:role/AmazonEKS_EBS_CSI_DriverRole"
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_eks_node_group.node-group["eu-north-1a"] will be created
  + resource "aws_eks_node_group" "node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "SPOT"
      + cluster_name           = "dev-conquer-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "dev-conquer-node-group-0"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::014630368052:role/dev-conquer-eks-worker-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-09bcb4615cab992bf",
        ]
      + tags_all               = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @carlosgit2016, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*